[
    {
      "image_url": "https://i.ibb.co/0MrnJDc/6.png",
      "rating": 4.5,
      "title": "Car Engine Plug",
      "price": 89.99,
      "description": "A high-precision Car Engine Plug for accurate readings of your car's speed and engine RPM. Features a clear display with backlight for easy reading in any lighting condition."
    },
    {
      "image_url": "https://i.ibb.co/b6mbLQr/3.png",
      "rating": 4.2,
      "title": "Car Air Filter",
      "price": 59.99,
      "description": "Keep track of your car's fuel level and estimate the remaining driving range with this Car Air Filter. It provides real-time updates and alerts for low fuel levels."
    },
    {
      "image_url": "https://i.ibb.co/NxjvGr0/1.png",
      "rating": 4.8,
      "title": "Cools Led Light",
      "price": 129.99,
      "description": "A comprehensive Cools Led Light that can read and clear trouble codes from your car's onboard computer. It provides valuable insights into your car's health and performance."
    },
    {
      "image_url": "https://i.ibb.co/jHdzPnz/2.png",
      "rating": 4.6,
      "title": "GPS Navigation System",
      "price": 199.99,
      "description": "Never get lost again with this advanced GPS navigation system. It offers real-time traffic updates, voice-guided directions, and points of interest for a smooth and enjoyable driving experience."
    },
    {
      "image_url": "https://i.ibb.co/RvBp1Fm/5.png",
      "rating": 4.0,
      "title": "OBD-II Bluetooth Adapter",
      "price": 29.99,
      "description": "Turn your smartphone into a car diagnostics tool with this OBD-II Bluetooth adapter. Connect it to your car's OBD port and use compatible apps to monitor your car's performance and diagnose issues."
    },
    {
      "image_url": "https://i.ibb.co/7WYD0VV/4.png",
      "rating": 4.4,
      "title": "Blind Spot Detection System",
      "price": 149.99,
      "description": "Enhance safety on the road with this blind spot detection system. It uses radar sensors to detect vehicles in your blind spots and provides visual or audible alerts to prevent potential accidents."
    },
    {
      "image_url": "https://images.pexels.com/photos/8985454/pexels-photo-8985454.jpeg?auto=compress&cs=tinysrgb&w=600",
      "rating": 4.7,
      "title": "Multifunctional Car HUD",
      "price": 79.99,
      "description": "Upgrade your driving experience with this multifunctional car HUD (Head-Up Display). It projects essential information like speed, navigation, and more on your windshield for easy access without looking away from the road."
    },
    {
      "image_url": "https://images.pexels.com/photos/132657/pexels-photo-132657.jpeg?auto=compress&cs=tinysrgb&w=600",
      "rating": 4.1,
      "title": "Tire Pressure Monitoring System",
      "price": 69.99,
      "description": "Maintain optimal tire pressure and improve fuel efficiency with this tire pressure monitoring system. It provides real-time tire pressure and temperature readings with visual and audible alerts for low pressure."
    },
    {
      "image_url": "https://images.pexels.com/photos/110990/pexels-photo-110990.jpeg?auto=compress&cs=tinysrgb&w=600",
      "rating": 4.3,
      "title": "Rear-View Camera Kit",
      "price": 109.99,
      "description": "Improve visibility and safety while reversing with this rear-view camera kit. It includes a high-resolution camera and a display screen that shows a clear view of what's behind your car."
    },
    {
      "image_url": "https://images.pexels.com/photos/5158168/pexels-photo-5158168.jpeg?auto=compress&cs=tinysrgb&w=600",
      "rating": 4.9,
      "title": "Car Performance Chip",
      "price": 249.99,
      "description": "Boost your car's performance with this plug-and-play car performance chip. It optimizes engine parameters for increased power and fuel efficiency while maintaining engine safety."
    }
  ]